rokudev/lt-sdk/lt/platforms/esp32/source/esp32/driver/wifi/esp32/Esp32DriverWiFi.c
/*******************************************************************************
 *
 * Esp32DriverWiFi: LT WiFi driver for Esp32
 * -----------------------------------------
 *
 * This Source Code Form is subject to the terms of the Mozilla Public License, v. 2.0.
 * If a copy of the MPL was not distributed with this file, you can obtain one at
 * https://mozilla.org/MPL/2.0/.
 *
 * Copyright 2026 Roku Inc. All rights reserved.
 *
 ******************************************************************************/

#include <lt/LT.h>
#include <lt/utility/macaddress/LTUtilityMacAddress.h>
#include <lt/device/wifi/LTDriverWiFi.h>
#include <lt/device/wifi/LTDriverWiFiUtil.h>
#include "../../esp32-lt-os-adapter/Esp32_LTOSAdapter.h"

typedef LT_SIZE size_t;
#undef  va_list
#define va_list     lt_va_list
#undef  va_start
#define va_start    lt_va_start
#undef  va_arg
#define va_arg      lt_va_arg
#undef  va_end
#define va_end      lt_va_end
#undef  va_copy
#define va_copy     lt_va_copy

#define _VA_LIST_
#include <espidf_wifi.h>
/* Do not include LTDeviceWiFi.h to provide isolation from upper WiFi layers */
DEFINE_LTLOG_SECTION("esp32.drv.wifi");

// #define DBLOG(...) LTLOG(__VA_ARGS__)
#define DBLOG(...)

/*******************************************************************************
 * WiFi Related Configuration
 ******************************************************************************/
#define DEFAULT_LISTEN_INTERVAL 3
// !!!FIXME: find a better way go deal with handle/index conversions
#define WLAN0_IDX 0
static LTDeviceUnit WLAN0_IDX_hUnit = 0;

// See LT-1252 regarding these locks
#ifdef DISABLE_WIFIAPI_LOCKS
#define LOCK_WIFIAPI()
#define UNLOCK_WIFIAPI()
#else
#define LOCK_WIFIAPI()   LTEsp32OSAdapter_LockWiFiApi(__LINE__)
#define UNLOCK_WIFIAPI() LTEsp32OSAdapter_UnlockWiFiApi()
#endif

static int HandleToIndex(LTDeviceUnit h_unit)
{
    (void) h_unit;
    return WLAN0_IDX;
}
/*******************************************************************************
 * LT Related Declarations
 ******************************************************************************/

static LTCore               * pCore             = NULL;
static ILTThread            * iThread           = NULL;
static LTUtilityMacAddress  * MAC_Library       = NULL;

#define CLEAR(v) lt_memset(v, 0, sizeof(*v))

/*******************************************************************************
 *
 * The DriverWiFi Abstract Interface
 * ---------------------------------
 *
 * This interface provides isolation between the WiFi state machine and vendor
 * specific WiFi driver and WPA supplicant implementations.
 *
 * IMPORTANT RULE: This is no blocking or timing at this driver interface.
 * That makes it possible for the LTDeviceWifi layer to handle all time
 * related conditions, including timeouts. Please heed this rule.
 *
 * This interface is called only by the WiFi state machine which coordinates
 * and synchronizes access to these features to minimize locking and reduce
 * complex state management within the vendor device implementation. Only
 * short-period blocking is allowed. The WiFi state machine will also prevent
 * overlapped calls that would cause driver conflicts or malfunctions. For
 * example, a scan will not be called while a join is being processed.
 *
 ******************************************************************************/
static LTWiFi_DisconnectReason DriverWiFi_GetDiscReasonCode(LTDeviceUnit h_unit);

/** Utility Functions *********************************************************/

static LTWiFi_ApSecurity Esp32ToLtSecurity(wifi_auth_mode_t authmode, wifi_cipher_type_t pairwise_cipher,  wifi_cipher_type_t group_cipher)
{
    LT_UNUSED(group_cipher);
    LTWiFi_ApSecurity retApSec = kLTWiFi_ApSecurity_Unknown;
    switch (authmode) {
    case WIFI_AUTH_OPEN:
        retApSec = kLTWiFi_ApSecurity_Open;
        break;
    case WIFI_AUTH_WEP:
        retApSec = kLTWiFi_ApSecurity_Wep;
        break;
    case WIFI_AUTH_WPA_PSK:
        retApSec = kLTWiFi_ApSecurity_Wpa;
        break;
    case WIFI_AUTH_WPA2_PSK:
        retApSec = kLTWiFi_ApSecurity_Wpa2;
        break;
    case WIFI_AUTH_WPA_WPA2_PSK:
        retApSec = kLTWiFi_ApSecurity_Wpa2;
        break;
    default:
        retApSec = kLTWiFi_ApSecurity_Unknown;

    }

    switch (pairwise_cipher) {
    case WIFI_CIPHER_TYPE_NONE:
        retApSec = kLTWiFi_ApSecurity_Open;
        break;
    case WIFI_CIPHER_TYPE_WEP40:
    case WIFI_CIPHER_TYPE_WEP104:
        retApSec = kLTWiFi_ApSecurity_Wep;
        break;

    case WIFI_CIPHER_TYPE_TKIP:
        retApSec = kLTWiFi_ApSecurity_Wpa2Tkip;
        break;

    case WIFI_CIPHER_TYPE_CCMP:
    case WIFI_CIPHER_TYPE_TKIP_CCMP:
        retApSec = kLTWiFi_ApSecurity_Wpa2;
        break;

    case WIFI_CIPHER_TYPE_AES_CMAC128:
        retApSec = kLTWiFi_ApSecurity_WpaAes;
        break;
    default:
        break;
    }
    return retApSec;
}
#define MAX_CONNECT_RETRY 3
typedef struct WiFiUnit {
    bool            is_hardware_up;     // chip and lower driver operating
    bool            is_up;              // driver operating
    bool            is_connected;       // STA joined to AP (aka linked)
    bool            scan_active;        // scan in progress
    s8              debug_mode;         // for more verbose debug info

    // Hack for first connect
    bool            is_joining;
    s8              connect_retry;
    LTWiFi_ScanSpec scan_spec;
    LTWiFi_ApInfo   ap_join_spec;
    int ref_cnt;
    LTWiFi_JoinStatus join_status;
    LTWiFi_FrameRxCallback *rx_frame;
    void *rx_client_data;
    LTWiFi_JoinStatus_CB  *join_driver_CB;
    LTWiFi_ScanResults_CB *scan_driver_CB;
    bool            suppress_join_callback;
    wifi_scan_config_t scan_params;
    wifi_err_reason_t disconnect_reason;
    LTTime disconnect_time;
    bool disconnect_logging;
    u32             txFrameCount;
    u32             rxFrameCount;
} WiFiUnit;

static WiFiUnit s_Esp32WiFiUnit;
/** Unit Functions ************************************************************/

WiFiUnit *CreateWiFiUnit(void)
{
    WiFiUnit *unit = &s_Esp32WiFiUnit;
    if (!unit->is_hardware_up) {
        CLEAR(unit);
    } else {
        int ref_cnt = unit->ref_cnt;
        CLEAR(unit);
        unit->ref_cnt = ref_cnt;
        unit->is_hardware_up = true;
    }
    unit->disconnect_logging = true;
    return unit;
}

void DestroyWiFiUnit(WiFiUnit *unit)
{
    LT_UNUSED(unit);
}

