rokudev/lt-sdk/lt/platforms/esp32/source/esp32/driver/wifi/esp32/Esp32DriverWiFi.c
// Get rid of unit handles in this driver - we don't use them and they just present more failure surface
// In fact, the LTDriverWiFi should be modified to take a data pointer, not a handle.
#define GET_UNIT(wu, hu) LT_UNUSED(hu); WiFiUnit *wu = &s_Esp32WiFiUnit;
#define GET_UNIT_RETURN(wu, hu, code) LT_UNUSED(hu); LT_UNUSED(code); WiFiUnit *wu = &s_Esp32WiFiUnit;

/*******************************************************************************
 * API Functions
 ******************************************************************************/

/** Driver ********************************************************************/

static void Roku_GetChipInfo(char **id, u8 *cver)
{
    *id = "Esp32";
    *cver = 1;
}
static bool esp_wifi_is_up(void)
{
    wifi_mode_t mode;
    LOCK_WIFIAPI();
    esp_err_t ret = esp_wifi_get_mode(&mode);
    UNLOCK_WIFIAPI();
    if (ret == ESP_OK) {
        return true;
    }
    return false;
}

static bool esp_wifi_is_connected(void)
{
    wifi_mode_t mode;
    esp_err_t ret = esp_wifi_get_mode(&mode);
    if (ret == ESP_OK && mode == WIFI_MODE_STA) {
        LTDeviceUnit h_unit = WLAN0_IDX_hUnit;
        if (!h_unit) return false;
        GET_UNIT_RETURN(unit, h_unit, false);
        return (unit->is_connected);
    }
    return false;
}

extern esp_err_t esp_wifi_deinit(void);
extern int esp_wifi_adapter_init(int *p_wifi_ref_cnt);

static bool DriverWiFi_GetDriverInfo(LTDeviceUnit h_unit, LTWiFi_DriverInfo *info)
{
    GET_UNIT_RETURN(unit, h_unit, false);
    if (!esp_wifi_is_up()) unit->is_up = false;
    CLEAR(info);
    esp_read_mac((u8 *)&info->mac_address, ESP_MAC_WIFI_STA);
    // This code to change once Realtek provides actual API function for it:
    char *id;
    u8 cver;
    Roku_GetChipInfo(&id, &cver);
    char version[2];
    version[0] = '0' + cver;
    version[1] = 0;

    lt_strncpyTerm(info->vendor,  "Espressif",       sizeof(info->vendor));
    lt_strncpyTerm(info->product, id,          sizeof(info->product));
    lt_strncpyTerm(info->version, version,     sizeof(info->version));
    lt_strncpyTerm(info->updated, "2022-05-19", sizeof(info->updated));
    return unit->is_up;
}

static bool DriverWiFi_SetDriverState(LTDeviceUnit h_unit, LTWiFi_DriverState state)
{
    GET_UNIT_RETURN(unit, h_unit, false);
    switch (state) {
    case kLTWiFi_DriverState_Up:
        if (unit->is_up) return true; // don't attempt UP if already UP
        // Bring up HW first:
        if (!unit->is_hardware_up) {
            if (esp_wifi_adapter_init(&(unit->ref_cnt)) != ESP_OK) {
                LTLOG_REDALERT("up.fail", "UP failed");
                return false;
            }
            unit->is_hardware_up = true;
        }
        LOCK_WIFIAPI();
        esp_err_t ret;
#if 0   // It seems counter productive to call stop in the UP flow. A DriverState_Down
        // Would do this for us in the case we want to down-then-up the driver.
        esp_err_t ret = esp_wifi_stop();
        if (ret != ESP_OK) {
            UNLOCK_WIFIAPI();
            LTLOG_REDALERT("wifi.stop.err1", "Failed to stop. ret=%d\n", ret);
            return false;
        }
#endif
        ret = esp_wifi_set_mode(WIFI_MODE_STA);
        if (ret != ESP_OK) {
            UNLOCK_WIFIAPI();
            LTLOG_REDALERT("up.fail1", "Failed to set Wi-Fi mode=%d ret=%d\n", WIFI_MODE_STA, ret);
            return false;
        }
        ret = esp_wifi_start();
        if (ret != ESP_OK) {
            UNLOCK_WIFIAPI();
            LTLOG_REDALERT("up.fail2", " start ret=%d", ret);
            return false;
        }
        unit->is_up = true;
        UNLOCK_WIFIAPI();
        break;
    case kLTWiFi_DriverState_Down:
        LOCK_WIFIAPI();
        ret = esp_wifi_disconnect();
        if (ret != ESP_OK) {
            UNLOCK_WIFIAPI();
            LTLOG_REDALERT("down.fail.disconn", "disconnect failed, ret=%d", ret);
            return false;
        }
        unit->is_connected = false; // !!! if was connected, needs to notify app
        unit->is_up = false;
        ret = esp_wifi_stop();
        if (ret != ESP_OK) {
            UNLOCK_WIFIAPI();
            LTLOG_REDALERT("down.fail.stop", "stop failed, ret=%d", ret);
            return false;
        }
        UNLOCK_WIFIAPI();
        ret = esp_wifi_deinit();
        if (ret != ESP_OK) {
            LTLOG_REDALERT("down.fail", "down failed");
            return false;
        }
        unit->is_hardware_up = false;
        break;
    case kLTWiFi_DriverState_ResetChip:
    // Can we do it on ESP32 chip???.
    case kLTWiFi_DriverState_ResetDriver:
        // This is how Realtek wants us to do it, but lacks fundamental control.
        DriverWiFi_SetDriverState(h_unit, kLTWiFi_DriverState_Down);
        DriverWiFi_SetDriverState(h_unit, kLTWiFi_DriverState_Up);
        break;
    default:
        return false;
    }
    return true;
}

static LTWiFi_DriverState DriverWiFi_GetDriverState(LTDeviceUnit h_unit)
{
    GET_UNIT_RETURN(unit, h_unit, kLTWiFi_DriverState_Unknown);
    // Use and active check in case driver fails in some serious way.
    // Of course, this requires an accurate chip, phy, and driver UP status.
    if (esp_wifi_is_up()) {
        if (esp_wifi_is_connected()) {
            return kLTWiFi_DriverState_Connected;
        }
        unit->is_connected = false;
        return kLTWiFi_DriverState_Up;
    }
    if (!unit->is_hardware_up) {
        return kLTWiFi_DriverState_Init;
    }
    return kLTWiFi_DriverState_Down;
}

static bool DriverWiFi_SetOption(LTDeviceUnit h_unit, char const *option, void *value)
{
    GET_UNIT_RETURN(unit, h_unit, false);
    LTLOG_DEBUG("set.opt", "set option %s", option);
    if (lt_strcmp(option, "debug_mode") == 0) {
        int mode = *(int*)value;  // !!! ugly, find better way
        unit->debug_mode = mode;
        return true;
    }
    if (lt_strcmp(option, "mac_address") == 0) {
#if 0
        LTMacAddress mac = *(LTMacAddress *)value;
        // !!! DriverInfo.mac_address = mac;
        char str[20];
        MAC_Library->MacAddressToString(&mac, str, 0); // Not in std ':' notation
        return esp_wifi_set_mac_address(str) == 0;
#else
        return false;
#endif
    }
    if (lt_strcmp(option, "channel") == 0) {
        LOCK_WIFIAPI();
        esp_err_t ret = esp_wifi_set_channel(*(int*)value,WIFI_SECOND_CHAN_NONE);
        UNLOCK_WIFIAPI();
        if (ret != ESP_OK) {
            return false;
        }
        return true;
    }
    if (lt_strcmp(option, "LogDisconnectReason") == 0) {
        switch (*(int*)value) {
        case 0: unit->disconnect_logging = false; break;
        case 1: unit->disconnect_logging = true; break;
        case 2: LTLOG("dcrsn", "%03lu.%06lu, %d",
                      (u32)LTTime_GetSeconds(unit->disconnect_time),
                      (u32)LTTime_GetMicroseconds(LTTime_FractionalSeconds(unit->disconnect_time)),
                      unit->disconnect_reason);
            break;
        default:
            return false;
        }
        return true;
    }
    return false;
}

