rokudev/lt-sdk/lt/platforms/esp32/source/esp32/driver/wifi/esp32/Esp32DriverWiFi.c
static bool DriverWiFi_GetOption(LTDeviceUnit h_unit, char const *option, void *value)
{
    LT_UNUSED(value);
    if (lt_strcmp(option, "mac_address") == 0) {
        // !!! *(LTMacAddress *)value = DriverInfo.mac_address;
        return true;
    }
    if (lt_strcmp(option, "channel") == 0) {
        u8 channel;
        wifi_second_chan_t sec_channel;
        LOCK_WIFIAPI();
        esp_err_t ret = esp_wifi_get_channel(&channel,&sec_channel);
        UNLOCK_WIFIAPI();
        if (ret == ESP_OK) {
            LTLOG_DEBUG("chan", "channel is %u", (unsigned int)channel);
            *(int*)value = (int)channel;
            return true;
        } else {
            return false;
        }
    }
    if (lt_strcmp(option, "channels_1-14") == 0) {
        wifi_country_t country;
        LOCK_WIFIAPI();
        esp_err_t ret = esp_wifi_get_country(&country);
        UNLOCK_WIFIAPI();
        if (ret == ESP_OK) {
            *(int*)value = (1 << country.nchan) - 1; // Bit array of channels
            return true;
        } else {
            return false;
        }
    }
    if (lt_strcmp(option, "DisconnectReason") == 0) {
        *(int*)value = (int)DriverWiFi_GetDiscReasonCode(h_unit);
        return true;
    }
    return false;
}

static void DriverWiFi_GetMetrics(LTDeviceUnit h_unit, LTWiFi_Metrics *metrics, LT_SIZE sizeOfMetrics)
{
    LT_UNUSED(sizeOfMetrics);
    GET_UNIT(unit, h_unit);
    if (unit->debug_mode) {
        esp_wifi_statis_dump(WIFI_STATIS_ALL);
    }
    lt_memset(metrics, 0, sizeOfMetrics);
    metrics->tx_frame_count = unit->txFrameCount;
    metrics->rx_frame_count = unit->rxFrameCount;
}

/** Scan **********************************************************************/
void Esp32_ScanResult_STA_CB(unsigned int ap_num, wifi_ap_record_t *ap_list_buffer)
{
    LTDeviceUnit h_unit = WLAN0_IDX_hUnit;
    u16 bss_count = 0;
    if (!h_unit) return;
    GET_UNIT(unit, h_unit);
    if(!unit) {
        return;
    }
    if (!unit->scan_driver_CB) {
        LTLOG("sta.cb.nocb", "no callback");
        return;
    }
    if (ap_list_buffer == NULL) {
        unit->scan_active = false;
        unit->scan_driver_CB(h_unit, NULL);
        return;
    }
    u16 num = (u16)ap_num;
    LOCK_WIFIAPI();
    esp_err_t ret = esp_wifi_scan_get_ap_records(&num, ap_list_buffer);
    UNLOCK_WIFIAPI();
    if (ret != ESP_OK || num != ap_num) {
        LTLOG("sta.cb.nodata", "error %d: num received %d, expected %d",(int)ret, (int)num, (int)ap_num);
        return;
    }
    for (bss_count = 0; bss_count < num; bss_count++) {
        LTWiFi_ApInfo ap;
        CLEAR(&ap);
        ap.rssi = ap_list_buffer[bss_count].rssi;
        ap.channel = ap_list_buffer[bss_count].primary;
        ap.security = Esp32ToLtSecurity(ap_list_buffer[bss_count].authmode, ap_list_buffer[bss_count].pairwise_cipher, ap_list_buffer[bss_count].group_cipher);
        lt_strncpyTerm(ap.ssid, (const char *)ap_list_buffer[bss_count].ssid, sizeof(ap.ssid)-1);
        lt_memcpy(ap.bssid.octet, ap_list_buffer[bss_count].bssid, 6);
        //LTLOG_DEBUG("scan.cb", "ssid %s channel %d rssi %d", ap.ssid, (int)ap.channel, ap.rssi);
        unit->scan_driver_CB(h_unit, &ap); // callback will copy the ap struct
    }
    unit->scan_active = false;
    unit->scan_driver_CB(h_unit, NULL);
    return;
}
static void DriverWiFi_ScanStart(LTDeviceUnit h_unit, LTWiFi_ScanSpec *spec, LTWiFi_ScanResults_CB callback)
{
    GET_UNIT(unit, h_unit);
    if (!unit->is_up) return;
    unit->scan_spec = *spec;
    unit->scan_active = false;
    unit->scan_driver_CB = callback; // h_unit will provide context
    // Note: The state machine guarantees there will never be simultaneous
    // requests to the WiFi driver scan and joins.
    // Note: unit struct not local, resides in handle
    int result = ESP_OK;
    CLEAR(&(unit->scan_params));
    unit->scan_params.scan_type = WIFI_SCAN_TYPE_ACTIVE; /* WIFI_SCAN_TYPE_PASSIVE; */
    if (spec->channel) {
        unit->scan_params.channel = spec->channel[0]; /* FIXME: handle the whole array */
    }
    if (spec->ssid) {
        unit->scan_params.ssid = (u8*)spec->ssid; // caller guarantees lifefime
    }
    LOCK_WIFIAPI();
    esp_wifi_scan_stop();
    result = esp_wifi_scan_start(&(unit->scan_params), false);
    UNLOCK_WIFIAPI();
    if (result != ESP_OK) {
        LTLOG("scan.fail", "scan fail: %d", result);
        // !!! add notification that it failed?
        return;
    }
    unit->scan_active = true;
}

static void DriverWiFi_ScanCheck(LTDeviceUnit h_unit)
{
    // Esp32 has true callback, so this helper function isn't needed.
    LT_UNUSED(h_unit);
}

static void DriverWiFi_ScanAbort(LTDeviceUnit h_unit)
{
    // !!! TBD
    GET_UNIT(unit, h_unit);
    if (!unit->is_up) return;
}

/** Join **********************************************************************/

// These callback functions interface the Esp32 WiFi API into the LT WiFi.
// They execute in the context of the Esp32 WiFi code, so beware of that.


static void Esp32_JoinStatus_STA_CB(LTWiFi_JoinStatus status)
{
    LTDeviceUnit h_unit = WLAN0_IDX_hUnit;
    if (!h_unit) return;
    GET_UNIT(unit, h_unit);
    unit->join_status = status;
    unit->is_connected = status == kLTWiFi_JoinStatus_Success;
    if (unit->suppress_join_callback == true) {
        return;
    }
    unit->join_driver_CB(h_unit, status);
}

void Esp32_JoinStatus_STA_CB_Success(void)
{
    LTDeviceUnit h_unit = WLAN0_IDX_hUnit;
    if (!h_unit) return;
    GET_UNIT(unit, h_unit);
    unit->is_joining = false;
    Esp32_JoinStatus_STA_CB(kLTWiFi_JoinStatus_Success);
}
void Esp32_JoinStatus_STA_CB_Failed(wifi_err_reason_t reason)
{
    LTDeviceUnit h_unit = WLAN0_IDX_hUnit;
    if (!h_unit) return;
    GET_UNIT(unit, h_unit);
    unit->disconnect_reason = reason;
    unit->disconnect_time = LT_GetCore()->GetClockTimeUTC();
    if (LTTime_IsZero(unit->disconnect_time)) {
        unit->disconnect_time = LT_GetCore()->GetKernelTime();
    }
    if (unit->disconnect_logging) {
        LTLOG_SERVER("cb.dcrsn", "%d", reason);
    }
    if (unit->is_joining && unit->connect_retry < MAX_CONNECT_RETRY) {
        LOCK_WIFIAPI();
        int ret = esp_wifi_connect();
        UNLOCK_WIFIAPI();
        unit->connect_retry++;
        if (ret == ESP_OK) {
            return;
        }
    }
    unit->is_joining = false;
    Esp32_JoinStatus_STA_CB(kLTWiFi_JoinStatus_Failed);
}

static void DriverWiFi_JoinStart(LTDeviceUnit h_unit, LTWiFi_ApInfo *ap_spec, LTWiFi_JoinStatus_CB callback)
{
    wifi_config_t wifi_cfg;
    esp_err_t ret;
    GET_UNIT(unit, h_unit);
    if (!unit->is_up) return;
    unit->join_status = kLTWiFi_JoinStatus_Unknown;
    unit->join_driver_CB = callback;  // h_unit will provide context
    unit->ap_join_spec = *ap_spec; // ap validated already, no further need to do so
    unit->join_status = kLTWiFi_JoinStatus_Starting;
    unit->txFrameCount = 0;
    unit->rxFrameCount = 0;

    // LT-1206 - oddly, the JoinAbort disconnect is not enough
    unit->suppress_join_callback = true;
    LOCK_WIFIAPI();
    esp_wifi_disconnect();
    UNLOCK_WIFIAPI();
    for (int retry = 0 ; unit->is_connected && retry < 50 ; retry++) {
        iThread->Sleep(LTTime_Milliseconds(1)); // Wait for disconnect
    }
    unit->suppress_join_callback = false;
    unit->is_connected = false;
    unit->is_joining = true;
    unit->connect_retry = 1;

    LOCK_WIFIAPI();
    CLEAR(&wifi_cfg);
    ret = esp_wifi_get_config(WIFI_IF_STA, &wifi_cfg);
    if (ret != ESP_OK) {
        UNLOCK_WIFIAPI();
        unit->join_status = kLTWiFi_JoinStatus_Failed;
        LTLOG("join.fail.0", "join failed: get config ret=%d", ret);
        return;
    }
    lt_memcpy(wifi_cfg.sta.ssid, &ap_spec->ssid, lt_strlen(ap_spec->ssid) + 1);
    if (ap_spec->pass != NULL) {
        lt_memcpy(wifi_cfg.sta.password, (unsigned char *)ap_spec->pass, lt_strlen(ap_spec->pass) + 1);
    } else {
        wifi_cfg.sta.password[0] = '\0';
    }
    wifi_cfg.sta.pmf_cfg.capable = true;
    wifi_cfg.sta.listen_interval = DEFAULT_LISTEN_INTERVAL;
    wifi_cfg.sta.scan_method = WIFI_ALL_CHANNEL_SCAN;
    wifi_cfg.sta.channel = 0; // we may want to set the channel from WSM for initial join try
    ret = esp_wifi_set_config(WIFI_IF_STA, &wifi_cfg);
    if (ret != ESP_OK) {
        UNLOCK_WIFIAPI();
        unit->join_status = kLTWiFi_JoinStatus_Failed;
        LTLOG("join.fail.1", "join failed: set config ret=%d", ret);
        return;
    }
    ret = esp_wifi_connect();
    if (ret != ESP_OK) {
        UNLOCK_WIFIAPI();
        unit->join_status = kLTWiFi_JoinStatus_Failed;
        LTLOG("join.fail.2", "join failed: %d sec: %lu ssid: %s", ret, LT_Pu32(ap_spec->security), ap_spec->ssid);
        return;
    }
    UNLOCK_WIFIAPI();
}

static void DriverWiFi_JoinCheck(LTDeviceUnit h_unit)
{
    GET_UNIT(unit, h_unit);
    if (!unit->is_up) {
        //        if (unit->join_status == kLTWiFi_JoinStatus_Unknown) {
        //            return kLTWiFi_JoinStatus_Failed;
        //        }
        // !!! add notifier?
        unit->join_status = kLTWiFi_JoinStatus_Failed; // must unreg handler
    }
    if (unit->join_status >= kLTWiFi_JoinStatus_Success) { // includes Fail
#if 0
        /* Remove callbacks */
#endif
        //return unit->join_status; // done, do not JoinCheck again
    }
    //return kLTWiFi_JoinStatus_Associating; // assumed
}

static void DriverWiFi_JoinAbort(LTDeviceUnit h_unit)
{
    GET_UNIT(unit, h_unit);
    if (!unit->is_up) return;
    LOCK_WIFIAPI();
    esp_wifi_disconnect();
    UNLOCK_WIFIAPI();
    unit->is_connected = false;
    unit->is_joining = false;
}


static bool DriverWiFi_GetApInfo(LTDeviceUnit h_unit, LTWiFi_ApInfo *ap)
{
    GET_UNIT_RETURN(unit, h_unit, false);
    if (!unit->is_up || !unit->is_connected) return false;
    CLEAR(ap);
    wifi_ap_record_t ap_info;
    esp_err_t ret = esp_wifi_sta_get_ap_info(&ap_info);
    if (ret != ESP_OK) {
        LTLOG("ap.info", "FAILED");
        return false;
    }
    ap->rssi = ap_info.rssi;
    ap->channel = ap_info.primary;
    ap->pass = NULL;
    ap->security = Esp32ToLtSecurity(ap_info.authmode, ap_info.pairwise_cipher, ap_info.group_cipher);
    lt_memcpy(&ap->ssid, ap_info.ssid, lt_strlen((const char *)ap_info.ssid) + 1);
    lt_memcpy(&ap->bssid, ap_info.bssid, sizeof(ap->bssid));
    return true;
}

static void DriverWiFi_Disconnect(LTDeviceUnit h_unit)
{
    GET_UNIT(unit, h_unit);
    if (!unit->is_up) return;
    LOCK_WIFIAPI();
    esp_wifi_disconnect();
    UNLOCK_WIFIAPI();
    unit->is_connected = false;
}

/** Soft AP *******************************************************************/
/* This is never tested on Esp32 and so far will keep it off */
static bool DriverWiFi_ApStart(LTDeviceUnit h_unit, LTWiFi_ApInfo *ap_spec /* callback? */)
{
    GET_UNIT_RETURN(unit, h_unit, false);
    if (!unit->is_up) return false;
    int result;
#if 0
    result = esp32_start_softap();
#else
    result = ESP_OK;
#endif
    if (result != ESP_OK) {
        LTLOG("sap.fail", "soft AP failed: %d ssid: %s %s %d", result, ap_spec->ssid, ap_spec->pass, ap_spec->channel);
        return false;
    }
    return true;
}

/** Transfer ******************************************************************/

