rokudev/lt-sdk/lt/platforms/esp32/source/esp32/driver/wifi/esp32/Esp32DriverWiFi.c
static bool DriverWiFi_TransmitFrames(LTDeviceUnit h_unit, const LTBufferChain *bufferChain)
{
    GET_UNIT_RETURN(unit, h_unit, false);
    if (!unit->is_up || !esp_wifi_is_connected()) return false; // use esp call because unit->is_connected may not be updated yet
    LTEsp32OSAdapter_LockWiFiApi(__LINE__);
    while (bufferChain) {
        int ret = esp_wifi_internal_tx(WIFI_IF_STA, bufferChain->buffer, bufferChain->bytesUsed);
        DBLOG("wf.tx", "buf %p len %lu ret %d", bufferChain->buffer, bufferChain->bytesUsed, ret);
        unit->txFrameCount++; // assumes 1-to-1 with buffer
        if (ret != ESP_OK) {
            LTEsp32OSAdapter_UnlockWiFiApi();
            // LTLOG_REDALERT("tx.fail", "transmit failed: 0x%08lx len: %lu", LT_Ps32(ret), LT_Pu32(bufferChain->bytesUsed));
            return false;
        }
        bufferChain = bufferChain->next;
    }
    LTEsp32OSAdapter_UnlockWiFiApi();
    return true;
}
/* Note:
 *     All TX done/RX done/Error trigger functions are not called from
 *     interrupts, this is much different from ethernet driver, including:
 *       * wlan_rx_done
 *       * wlan_tx_done
 *
 *     These functions are called in a Wi-Fi private thread. So we just use
 *     mutex/semaphore instead of disable interrupt, if necessary.
 */
/****************************************************************************
 * Function: lt_wlan_sta_rx_done
 *
 * Description:
 *   Wi-Fi RX done callback function. If this is called, it means receiving
 *   packet.
 *
 * Input Parameters:
 *   unit   - Reference to the driver state structure
 *   buffer - Wi-Fi received packet buffer
 *   len    - Length of received packet
 *   eb     - Wi-Fi receive callback input eb pointer
 *
 * Returned Value:
 *   0 on success or a negated errno on failure
 *
 ****************************************************************************/

static esp_err_t lt_wlan_sta_rx_done(void *buffer, uint16_t len, void *eb)
{
    GET_UNIT_RETURN(unit, WLAN0_IDX_hUnit,false);
    LTBufferChain bufferChain = { .next = NULL, .buffer = lt_malloc(len), .size = len, .bytesUsed = len };
    DBLOG("wf.rx", "buf %p len %u rxcb %p", bufferChain.buffer, len, unit ? unit->rx_frame : NULL);
    unit->rxFrameCount++; // assumes 1-to-1 with buffer
    if (bufferChain.buffer) {
        lt_memcpy(bufferChain.buffer, buffer, len);
        if (unit == NULL || unit->rx_frame == NULL || !unit->rx_frame(&bufferChain,unit->rx_client_data)) {
            lt_free(bufferChain.buffer);
        }
    }
    if (eb) {
        LTEsp32OSAdapter_LockWiFiApi(__LINE__);
        esp_wifi_internal_free_rx_buffer(eb);
        LTEsp32OSAdapter_UnlockWiFiApi();
    }
    return ESP_OK;
}

static bool DriverWiFi_ReceiveFrame(LTDeviceUnit h_unit, LTWiFi_FrameRxCallback * pCallback, void * pClientData)
{
    GET_UNIT_RETURN(unit, h_unit,false);
    unit->rx_frame = pCallback;
    unit->rx_client_data = pClientData;
    LTEsp32OSAdapter_LockWiFiApi(__LINE__);
    esp_err_t ret = esp_wifi_internal_reg_rxcb(WIFI_IF_STA, lt_wlan_sta_rx_done);
    LTEsp32OSAdapter_UnlockWiFiApi();
    // !!!FIXME
    if (HandleToIndex(h_unit) == WLAN0_IDX) {
        WLAN0_IDX_hUnit = h_unit;
    }
    return (ret == ESP_OK);
}

/** Sniff used for MiniMesh and Promiscuous Monitor ***************************/

static LTWiFi_SniffCallback *SniffCallback;

static void DriverWiFi_SniffCallback(void *buf, wifi_promiscuous_pkt_type_t type)
{
    LTWiFi_FrameInfo info;
    wifi_promiscuous_pkt_t *sniffer = (wifi_promiscuous_pkt_t *)buf;
    info.frame = (LTWiFi_Header*)sniffer->payload;
    info.size  = sniffer->rx_ctrl.sig_len;
    info.rssi  = sniffer->rx_ctrl.rssi;
    if (sniffer->rx_ctrl.rx_state || type == WIFI_PKT_MISC) return;
    // LTLOG_DEBUG("sniff.cbk", "Got %u bytes, rssi %d, channel %u", info.size, info.rssi, (unsigned)sniffer->rx_ctrl.channel);
    if (SniffCallback) SniffCallback(&info); // arg valid only during callback
}


static void DriverWiFi_SniffFrames(LTDeviceUnit h_unit, LTWiFi_SniffCallback callback)
{
    GET_UNIT(unit, h_unit);
    esp_err_t ret;
    if (!unit->is_up) return;
    if (callback) {
        SniffCallback = callback;
        esp_wifi_set_promiscuous_rx_cb(DriverWiFi_SniffCallback);
        ret = esp_wifi_set_promiscuous(true);
        if (ret != ESP_OK) {
            LTLOG("sniff.frames","Error setting promisc mode %d", ret);
        }

    } else {
        // SniffCallback stays assigned in case it gets called before unreg happens
        esp_wifi_set_promiscuous(false);
    }
}

static int DriverWiFi_SendFrame(LTDeviceUnit h_unit, LTWiFi_Frame *frame)
{
    LT_UNUSED(h_unit);
    /* TODO: validate how flexible is it !!!*/
    esp_err_t ret = esp_wifi_80211_tx(WIFI_IF_STA, &(frame->header), frame->size, false);
    return (ESP_OK == ret)?(0):(ret);
}

static LTWiFi_DisconnectReason DriverWiFi_GetDiscReasonCode(LTDeviceUnit h_unit) {
    GET_UNIT_RETURN(unit, h_unit, kLTWiFi_DisconnectReason_Generic);

    LTWiFi_DisconnectReason dcrsn = kLTWiFi_DisconnectReason_Generic;
    switch (unit->disconnect_reason) {
    case WIFI_REASON_BEACON_TIMEOUT:
        dcrsn = kLTWiFi_DisconnectReason_DriverApKeepaliveTimeout;
        break;
    case WIFI_REASON_NO_AP_FOUND:
        dcrsn = kLTWiFi_DisconnectReason_DriverNoApFound;
        break;
    case WIFI_REASON_AUTH_FAIL:
        dcrsn = kLTWiFi_DisconnectReason_ApReceiveDeauth;
        break;
    case WIFI_REASON_ASSOC_FAIL:
        dcrsn = kLTWiFi_DisconnectReason_ApReceiveDisassoc;
        break;
    case WIFI_REASON_HANDSHAKE_TIMEOUT:
        dcrsn = kLTWiFi_DisconnectReason_Generic;
        break;
    case WIFI_REASON_CONNECTION_FAIL:
        dcrsn = kLTWiFi_DisconnectReason_DriverApKeepaliveTimeout;
        break;
    case WIFI_REASON_AP_TSF_RESET:
    case WIFI_REASON_ROAMING:
        dcrsn = kLTWiFi_DisconnectReason_Generic;
        break;
    default:
        dcrsn = LTDriverUtil_IeeeToLtDisconnectReason((WiFiDriver_80211ReasonCode)unit->disconnect_reason);
    }
    return dcrsn;
}

