rokudev/lt-sdk/lt/platforms/esp32/source/esp32/driver/wifi/esp32/Esp32DriverWiFi.c
/*******************************************************************************
 * LTDriverWiFi Hidden Library Interface
 ******************************************************************************/

define_LTDEVICE_DRIVER_IMPLEMENTATION(LTDriverWiFi, Esp32DriverWiFi);
/*
*   This special macro is defined in LTTypes.h.  It provides a declaration
*   of a  hidden library root interface of type LTDriverLibrary which carries the
*   prototype functions immediately below.  The first argument "LTDriverWiFi tells
*   LTCore that this driver library implements LTDriverWiFi and it also slaves
*   the library root interface version to the LTDriverWiFi version it was compiled
*   against.
*
*   In total, this macro does 5 things:
*    1. Creates a root library interface for the driver library
*    2. Types it as an LTDriverLibrary, giving it the driver type and the prototype functions thereof
*    3. Slaves the root interface version number to that of device's root interface version number so Device can know what its dealing with
*    4. Allows for more than one driver library to exist at runtime for the same device class.
*    5. Communicates the driver mapping to LTCore so that at runtime When LTDeviceWiFi wants to know
*        what WiFi drivers exist, LTCore can tell it.
*
*/

static bool Esp32DriverWiFiImpl_LibInit(void)
{
    pCore = LT_GetCore();
    if (!(MAC_Library = lt_openlibrary(LTUtilityMacAddress))) return false;
    iThread = lt_getlibraryinterface(ILTThread, LT_GetCore());
    LTEsp32OSAdapter_LibInit();
    return true;
}

static void Esp32DriverWiFiImpl_LibFini(void)
{
    lt_closelibrary(MAC_Library);       // null okay
    LTEsp32OSAdapter_LibFini();
}

static u32 Esp32DriverWiFiImpl_GetNumDeviceUnits(void)
{
    return 1; /* this driver library only knows how to control one physical WiFi hardware block */
}

static LTDriverWiFi s_LTDriverWiFi;
/* This is a forward declaration of the LTDriverWiFi interface instance that gets defined at the end of this file
   by the macro define_LTLIBRARY_INTERFACE(LTDriverWiFi).  The variable name has to be s_LTDriverWiFi because
   that is what the macro defines. */

static LTDeviceUnit Esp32DriverWiFiImpl_CreateDeviceUnitHandle(u32 nDeviceUnitNumber)
{
    /* Units are not the same as unit handles.  Multiple handles can exist for the same unit.
       In practice, LTDeviceWiFi is our only client and probably will only call us once per
       unit number, so likely a 1:1 mapping, but not necessarily. Since the client who calls create
       is the owner of the resource, and up to them to destroy the handle, we won't manage lists
       of handles or anything like that here. */
    if (nDeviceUnitNumber > 0) return (LTDeviceUnit)0;  // Only one, the STA for the network

    LTDeviceUnit hUnit = LT_GetCore()->CreateHandle((LTInterface *)&s_LTDriverWiFi, sizeof(WiFiUnit *));
    if (hUnit) {
        //See note above the GET_UNIT define
        //WiFiUnit **ppUnit = (WiFiUnit **)LT_GetCore()->GetHandlePrivateData(hUnit);
        //*ppUnit = CreateWiFiUnit();
        CreateWiFiUnit();
    }
    if (HandleToIndex(hUnit) == WLAN0_IDX) {
        WLAN0_IDX_hUnit = hUnit;
    }
    return hUnit;
}

// DestroyDeviceUnitHandle() not needed because handle interface provides the destroy.
static void Esp32DriverWiFi_OnDestroyHandle(LTHandle h_unit)
{
    GET_UNIT(unit, h_unit);
    DriverWiFi_SetDriverState(h_unit,kLTWiFi_DriverState_Down);
    DestroyWiFiUnit(unit);
}

define_LTLIBRARY_INTERFACE(LTDriverWiFi, Esp32DriverWiFi_OnDestroyHandle)
    .GetDriverInfo       = DriverWiFi_GetDriverInfo,
    .SetDriverState      = DriverWiFi_SetDriverState,
    .GetDriverState      = DriverWiFi_GetDriverState,
    .SetOption           = DriverWiFi_SetOption,
    .GetOption           = DriverWiFi_GetOption,
    .GetMetrics          = DriverWiFi_GetMetrics,
    .ScanStart           = DriverWiFi_ScanStart,
    .ScanCheck           = DriverWiFi_ScanCheck,
    .ScanAbort           = DriverWiFi_ScanAbort,
    .JoinStart           = DriverWiFi_JoinStart,
    .JoinCheck           = DriverWiFi_JoinCheck,
    .JoinAbort           = DriverWiFi_JoinAbort,
    .GetApInfo           = DriverWiFi_GetApInfo,
    .Disconnect          = DriverWiFi_Disconnect,
    .ApStart             = DriverWiFi_ApStart,
    .TransmitFrames      = DriverWiFi_TransmitFrames,
    .ReceiveFrame        = DriverWiFi_ReceiveFrame,
    .SniffFrames         = DriverWiFi_SniffFrames,
    .SendFrame           = DriverWiFi_SendFrame,
    .GetDiscReasonCode   = DriverWiFi_GetDiscReasonCode,
};
